Revit 2027 API
ViewScheduleExportOptions.HeadersFootersBlanks Property
 Whether to export group headers, footers, and blank lines. Default is true.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HeadersFootersBlanks { get; set; }
Public Property HeadersFootersBlanks As Boolean
	Get
	Set
public:
property bool HeadersFootersBlanks {
	bool get ();
	void set (bool value);
}
member HeadersFootersBlanks : bool with get, set
Property Value
Boolean
See Also
Reference
ViewScheduleExportOptions Class
Autodesk.Revit.DB Namespace